tap "cmacrae/formulae"
tap "dart-lang/dart"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
brew "bat"
brew "docker", link: false
brew "exa"
brew "fd"
brew "node"
brew "firebase-cli"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "htop"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "python@3.9"
brew "ripgrep"
brew "rustup-init"
brew "telnet"
brew "tmux"
brew "wget"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "leoafarias/fvm/fvm"
cask "alacritty"
cask "docker"
cask "drawio"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "microsoft-edge"
cask "numi"
cask "postman"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "abdoseadaa.node-js-snippet"
vscode "abusaidm.html-snippets"
vscode "aeschli.vscode-css-formatter"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alefragnani.Bookmarks"
vscode "alexisvt.flutter-snippets"
vscode "BendixMa.dart-data-class-generator"
vscode "CamilaMartinezBedoya.pro-hacker-theme"
vscode "circlecodesolution.ccs-flutter-color"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emilast.LogFileHighlighter"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "everettjf.pubspec-dependency-search"
vscode "FelixAngelov.bloc"
vscode "Flutterbricksproductions.flutterbricks"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "humao.rest-client"
vscode "IBM.output-colorizer"
vscode "jamesblasco.flutter-preview"
vscode "jdinhlife.gruvbox"
vscode "jeroen-meijer.pubspec-assist"
vscode "KiritchoukC.flutter-clean-architecture"
vscode "lehni.vscode-fix-checksums"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "MarufHassan.flutter"
vscode "MarufHassan.flutter-snippets"
vscode "mathiasfrohlich.Kotlin"
vscode "mhutchie.git-graph"
vscode "miquelddg.dart-barrel-file-generator"
vscode "monokai.theme-monokai-pro-vscode"
vscode "moyu.snapcode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "Nash.awesome-flutter-snippets"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "piyushvscode.nodejs-snippets"
vscode "PKief.material-icon-theme"
vscode "plibither8.remove-comments"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "roerohan.mongo-snippets-for-node-js"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.vscode-open-in-github"
vscode "TabNine.tabnine-vscode"
vscode "teabyii.ayu"
vscode "thekalinga.bootstrap4-vscode"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vinicioslc.adb-interface-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "xabikos.JavaScriptSnippets"
vscode "xabikos.ReactSnippets"
vscode "yinfei.luahelper"
vscode "yt1997kt.flutter-bloc"
vscode "yzhang.markdown-all-in-one"
vscode "zhouronghui.propertylist"
