tap "cmacrae/formulae"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
brew "bat"
brew "docker", link: false
brew "emacs"
brew "fd"
brew "node"
brew "firebase-cli"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "htop"
brew "jq"
brew "lazygit"
brew "libyaml"
brew "lsd"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "telnet"
brew "tmux"
brew "wget"
brew "leoafarias/fvm/fvm"
cask "alacritty"
cask "android-studio"
cask "docker"
cask "drawio"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "microsoft-edge"
cask "numi"
cask "orbstack"
cask "postman"
cask "visual-studio-code"
cask "wezterm"
