tap "cmacrae/formulae"
tap "dart-lang/dart"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
brew "bat"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "go"
brew "htop"
brew "lazygit"
brew "libyaml"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk"
brew "python@3.9"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "wget"
brew "dart-lang/dart/dart"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "leoafarias/fvm/fvm"
cask "alacritty"
cask "brave-browser"
cask "drawio"
cask "fig"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "gimp"
cask "intellij-idea-ce"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "microsoft-edge"
cask "numi"
cask "opera"
cask "visual-studio-code"
